try:
    a = int(input("Введите число: "))
except ValueError:
    a = int(input("ERROR, нужно ввести ЧИСЛО!"))
x1 = ["один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
x2 = ["одна", "две", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
x3 = ["одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
x4 = ["десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
x5 = ["сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]
x6 = ["тысяча", "тысячи", "тысяч"]
x7 = ["рубль", "рубля", "рублей"]

a1 = a // 100000
a2 = (a // 10000) % 10
a3 = (a // 1000) % 10
a4 = (a // 100) % 10
a5 = (a // 10) % 10
a6 = a % 10

s = ""
if a1 != 0:
    i1 = a1 - 1
    s += x5[i1] + " "

if a2 == 1 and a3 == 0:
    s += x4[0] + " "

if a2 != 1:
    if a2 != 0:
        i2 = a2 - 1
        s += x4[i2] + " "

if a3 != 0:
    if a2 == 1:
        i3 = a3 - 1
        s += x3[i3] + " " + x6[2] + " "
    else:
        i3 = a3 - 1
        s += x2[i3] + " "
        if a3 == 1:
            s += x6[0] + " "
        elif 1 < a3 < 5:
            s += x6[1] + " "
        else:
            s += x6[2] + " "

if (a3 == 0) and (a2 or a1 != 0):
    s += x6[2] + " "

if a4 != 0:
    i4 = a4 - 1
    s += x5[i4] + " "

if a5 == 1 and a6 == 0:
    s += x4[0] + " "

if a5 != 1:
    if a5 != 0:
        i5 = a5 - 1
        s += x4[i5] + " "

if a6 != 0:
    if a5 == 1:
        i6 = a6 - 1
        s += x3[i6] + " " + x7[2]
    else:
        i6 = a6 - 1
        s += x1[i6] + " "
        if a6 == 1:
            s += x7[0] + " "
        elif 1 < a6 < 5:
            s += x7[1] + " "
        else:
            s += x7[2] + " "

if (a6 == 0) and (a5 or a4 or a3 or  a2 or a1 !=0):
    s += x7[2]

s = s.capitalize()
print(s)
